In [2]:
from dateutil.parser import parse 
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd
plt.rcParams.update({'figure.figsize': (10, 7), 'figure.dpi': 120})

In [3]:
# Import Data
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/a10.csv', parse_dates=['date'], index_col='date')
df.reset_index(inplace=True)

In [4]:
df

          date      value
0   1991-07-01   3.526591
1   1991-08-01   3.180891
2   1991-09-01   3.252221
3   1991-10-01   3.611003
4   1991-11-01   3.565869
..         ...        ...
199 2008-02-01  21.654285
200 2008-03-01  18.264945
201 2008-04-01  23.107677
202 2008-05-01  22.912510
203 2008-06-01  19.431740

[204 rows x 2 columns]

In [5]:
# Prepare data
df['year'] = [d.year for d in df.date]
df['month'] = [d.strftime('%b') for d in df.date]
years = df['year'].unique()

In [6]:
years

array([1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001,
       2002, 2003, 2004, 2005, 2006, 2007, 2008], dtype=int64)

In [7]:
df

          date      value  year month
0   1991-07-01   3.526591  1991   Jul
1   1991-08-01   3.180891  1991   Aug
2   1991-09-01   3.252221  1991   Sep
3   1991-10-01   3.611003  1991   Oct
4   1991-11-01   3.565869  1991   Nov
..         ...        ...   ...   ...
199 2008-02-01  21.654285  2008   Feb
200 2008-03-01  18.264945  2008   Mar
201 2008-04-01  23.107677  2008   Apr
202 2008-05-01  22.912510  2008   May
203 2008-06-01  19.431740  2008   Jun

[204 rows x 4 columns]